[
  {
    "id": "llm-inference-platform-kubernetes",
    "title": "LLM Inference Platform on Kubernetes",
    "summary": "Built a production inference stack with autoscaling, canary rollout, and latency SLO monitoring for transformer-based services.",
    "details": "This platform standardized the path from trained LLM checkpoints to production endpoints.\n\nIt included autoscaling policies based on token throughput, rollout gates using latency/error budgets, and dashboard-first observability for SRE and ML teams.\n\nResult: faster releases, safer deployment confidence, and lower incident response time.",
    "tags": ["Kubernetes", "LLM", "Inference", "Prometheus", "Grafana"],
    "link": "#",
    "image": "",
    "imageAlt": ""
  },
  {
    "id": "mlops-pipeline-multilingual-nlp",
    "title": "MLOps Pipeline for Multilingual NLP",
    "summary": "Designed CI/CD + training pipelines with experiment tracking, model registry, and reproducible deployment for multilingual transformer models.",
    "details": "Created a complete experiment-to-production workflow for multilingual NLP models.\n\nThe solution combined dataset versioning, automated validation, benchmark reports, and promotion stages from dev to production.\n\nThis reduced training-serving mismatch and improved model reproducibility across teams.",
    "tags": ["MLflow", "Airflow", "Transformers", "CI/CD", "NLP"],
    "link": "#",
    "image": "",
    "imageAlt": ""
  },
  {
    "id": "drift-aware-monitoring-system",
    "title": "Drift-Aware Monitoring System",
    "summary": "Implemented feature and concept drift detection with alerting policy and retraining triggers for reliable production ML behavior.",
    "details": "Implemented drift monitoring with both statistical and performance-based drift detectors.\n\nAlerts were tied to on-call escalation and retraining playbooks, making the system operationally actionable instead of just informational.\n\nTeams gained early warning and better model lifecycle control.",
    "tags": ["Monitoring", "Drift", "Data Quality", "MLOps"],
    "link": "#",
    "image": "",
    "imageAlt": ""
  },
  {
    "id": "rag-knowledge-assistant",
    "title": "RAG Knowledge Assistant for Internal Docs",
    "summary": "Developed a retrieval-augmented assistant with evaluation harness, prompt governance, and observability for enterprise knowledge search.",
    "details": "Built a RAG assistant for internal documentation and standards lookup.\n\nIncluded retrieval diagnostics, response quality scoring, and prompt/version governance to maintain factuality and consistency.\n\nDelivered faster internal search outcomes with measurable quality controls.",
    "tags": ["RAG", "Embeddings", "Evaluation", "LLM Ops"],
    "link": "#",
    "image": "",
    "imageAlt": ""
  },
  {
    "id": "vision-model-deployment-blueprint",
    "title": "Vision Model Deployment Blueprint",
    "summary": "End-to-end deployment workflow for a computer vision model: training lineage, staged releases, and cost-performance optimization.",
    "details": "Designed production deployment architecture for a vision model with strict latency constraints.\n\nThe blueprint covered dataset lineage, staging validation, rollout checks, and resource tuning for GPU efficiency.\n\nIt became a reusable baseline for subsequent CV deployments.",
    "tags": ["Deep Learning", "Computer Vision", "Deployment"],
    "link": "#",
    "image": "",
    "imageAlt": ""
  },
  {
    "id": "feature-store-adoption-playbook",
    "title": "Feature Store Adoption Playbook",
    "summary": "Introduced feature store standards for offline/online parity, reducing training-serving skew across teams.",
    "details": "Defined feature contracts and ownership standards to align data engineering and ML development.\n\nThe playbook covered feature validation, freshness SLAs, backfill workflows, and discoverability conventions.\n\nOutcome: reduced leakage/skew risks and improved cross-team feature reuse.",
    "tags": ["Feature Store", "Platform", "Data Engineering"],
    "link": "#",
    "image": "",
    "imageAlt": ""
  }
]